-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 22 2019 г., 11:00
-- Версия сервера: 5.6.43
-- Версия PHP: 5.6.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `quiz`
--

-- --------------------------------------------------------

--
-- Структура таблицы `answers`
--

CREATE TABLE `answers` (
  `id` int(11) NOT NULL,
  `id_q` int(11) NOT NULL,
  `answerRUS` text NOT NULL,
  `answerKAZ` text NOT NULL,
  `next_q` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `answers`
--

INSERT INTO `answers` (`id`, `id_q`, `answerRUS`, `answerKAZ`, `next_q`) VALUES
(1, 1, 'Да', 'ОК', 2),
(2, 1, 'Нет', 'Жок', 3),
(3, 1, 'Хорошо', 'Жакши', 0),
(4, 2, 'Плохо', 'Жаман', 4),
(5, 2, 'Не понимаю', 'Моя твоя не понимать', 5),
(6, 2, 'Нет', 'Жок', 0),
(7, 3, 'Хорошо', 'Жакши', 7),
(8, 3, 'Хорошо', 'Жакши', 8),
(9, 3, 'Хорошо', 'Жакши', 0),
(10, 4, 'Хорошо', 'Жакши', 9),
(11, 4, 'Хорошо', 'Жакши', 0),
(12, 5, 'Хорошо', 'Жакши', 10),
(13, 5, 'Хорошо', 'Жакши', 0),
(14, 6, 'Хорошо', 'Жакши', 11),
(15, 6, 'Хорошо', 'Жакши', 0),
(16, 7, 'Хорошо', 'Жакши', 12),
(17, 7, 'Хорошо', 'Жакши', 0),
(18, 8, 'Хорошо', 'Жакши', 13),
(19, 8, 'Хорошо', 'Жакши', 0),
(20, 9, 'Хорошо', 'Жакши', 14),
(21, 9, 'Хорошо', 'Жакши', 0),
(22, 10, 'Хорошо', 'Жакши', 15),
(23, 10, 'Хорошо', 'Жакши', 0),
(24, 11, 'Хорошо', 'Жакши', 16),
(25, 11, 'Хорошо', 'Жакши', 0),
(26, 12, 'Хорошо', 'Жакши', 17),
(27, 12, 'Хорошо', 'Жакши', 0),
(28, 13, 'Хорошо', 'Жакши', 18),
(29, 13, 'Хорошо', 'Жакши', 0),
(30, 14, 'Хорошо', 'Жакши', 19),
(31, 14, 'Хорошо', 'Жакши', 0),
(32, 15, 'Хорошо', 'Жакши', 20),
(33, 15, 'Хорошо', 'Жакши', 0),
(34, 16, 'Хорошо', 'Жакши', 0),
(35, 16, 'Хорошо', 'Жакши', 0),
(36, 17, 'Хорошо', 'Жакши', 0),
(37, 17, 'Хорошо', 'Жакши', 0),
(38, 18, 'Хорошо', 'Жакши', 0),
(39, 18, 'Хорошо', 'Жакши', 0),
(40, 19, 'Хорошо', 'Жакши', 0),
(41, 19, 'Хорошо', 'Жакши', 0),
(42, 20, 'Хорошо', 'Жакши', 0),
(43, 20, 'Хорошо', 'Жакши', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `question`
--

CREATE TABLE `question` (
  `id` int(11) NOT NULL,
  `qRus` text NOT NULL,
  `qKaz` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `question`
--

INSERT INTO `question` (`id`, `qRus`, `qKaz`) VALUES
(1, 'Вопрос 1', 'Вопрос 1кз'),
(2, 'Вопрос 2', 'Вопрос 2кз'),
(3, 'Вопрос 3', 'Вопрос 3кз'),
(4, 'Вопрос 4', 'Вопрос 4кз'),
(5, 'Вопрос 5', 'Вопрос 5кз'),
(6, 'Вопрос 6', 'Вопрос 6кз'),
(7, 'Вопрос 7', 'Вопрос 7кз'),
(8, 'Вопрос 8', 'Вопрос 8кз'),
(9, 'Вопрос 9', 'Вопрос 9кз'),
(10, 'Вопрос 10', 'Вопрос 10кз'),
(11, 'Вопрос 11', 'Вопрос 11кз'),
(12, 'Вопрос 12', 'Вопрос 12кз'),
(13, 'Вопрос 13', 'Вопрос 13кз'),
(14, 'Вопрос 14', 'Вопрос 14кз'),
(15, 'Вопрос 15', 'Вопрос 15кз'),
(16, 'Вопрос 16', 'Вопрос 16кз'),
(17, 'Вопрос 17', 'Вопрос 17кз'),
(18, 'Вопрос 18', 'Вопрос 18кз'),
(19, 'Вопрос 19', 'Вопрос 19кз'),
(20, 'Вопрос 20', 'Вопрос 20кз');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT для таблицы `question`
--
ALTER TABLE `question`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
